from random import randint

# Задайте последовательность чисел. Напишите программу,
# которая выведет список неповторяющихся элементов исходной последовательности.

# задаем рандомную последовательность целых чисел в списке
lst_in = [randint(0, 10) for i in range(randint(1, 10))]

# выводим последовательность чисел
print(f'Исходный список: {lst_in}')

# записываем список в множество для удаления дублей
lst = set(lst_in)

# выводим список неповторяющихся элементов
print(f'Список неповторяющихся элементов: {list(lst)}')
